## **Pivot Table**

In [56]:
import numpy as np
import pandas as pd

In [57]:
sales = pd.read_csv("data/sales_by_employee.csv", parse_dates=["Date"])
sales

C:\Users\toapr\AppData\Local\Temp\ipykernel_23724\2914903902.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sales = pd.read_csv("data/sales_by_employee.csv", parse_dates=["Date"])

         Date     Name           Customer  Revenue  Expenses
0  2020-01-01    Oscar      Logistics XYZ     5250       531
1  2020-01-01    Oscar        Money Corp.     4406       661
2  2020-01-02    Oscar         PaperMaven     8661      1401
3  2020-01-03    Oscar        PaperGenius     7075       906
4  2020-01-04    Oscar        Paper Pound     2524      1767
5  2020-01-05    Oscar        Paper Pound     2793       624
6  2020-01-01  Michael      Logistics XYZ     7172       412
7  2020-01-02  Michael        PaperGenius     6362       685
8  2020-01-03  Michael        PaperGenius     5982      1772
9  2020-01-04  Michael     Best Paper Co.     7917      1857
10 2020-01-05  Michael     Best Paper Co.     7837      1633
11 2020-01-01      Jim        PaperGenius     1864      1305
12 2020-01-02      Jim        Money Corp.     8278       462
13 2020-01-03      Jim        Paper Pound     4226      1923
14 2020-01-04      Jim         PaperMaven     3868      1889
15 2020-01-04      Jim  Average Paper Co.     2287       426
16 2020-01-01   Dwight        PaperGenius     2639       368
17 2020-01-03   Dwight      Logistics XYZ     4951       758
18 2020-01-03   Dwight     Best Paper Co.     2703      1321
19 2020-01-03   Dwight      Logistics XYZ     4258      1202
20 2020-01-05   Dwight        Paper Pound     7771      1475
21 2020-01-01    Creed        Money Corp.     4430       548
22 2020-01-02    Creed  Average Paper Co.     8026      1906
23 2020-01-02    Creed  Average Paper Co.     5188      1768
24 2020-01-04    Creed         PaperMaven     3144      1314
25 2020-01-05    Creed        Money Corp.      938      1053

In [58]:
sales.pivot_table(
    index="Name",
    columns="Date",
    values="Revenue",
    aggfunc="sum"
)

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed        4430.0     13214.0         NaN      3144.0       938.0
Dwight       2639.0         NaN     11912.0         NaN      7771.0
Jim          1864.0      8278.0      4226.0      6155.0         NaN
Michael      7172.0      6362.0      5982.0      7917.0      7837.0
Oscar        9656.0      8661.0      7075.0      2524.0      2793.0

In [59]:
sales.pivot_table(
    index="Name",
    values="Revenue",
    aggfunc="sum"
)

         Revenue
Name
Creed      21726
Dwight     22322
Jim        20523
Michael    35270
Oscar      30709

In [60]:
sales.pivot_table(
    index=["Name", "Date"],
    values="Revenue",
    aggfunc="sum"
)                                                               # each sales person sales wrt date

                    Revenue
Name    Date
Creed   2020-01-01     4430
        2020-01-02    13214
        2020-01-04     3144
        2020-01-05      938
Dwight  2020-01-01     2639
        2020-01-03    11912
        2020-01-05     7771
Jim     2020-01-01     1864
        2020-01-02     8278
        2020-01-03     4226
        2020-01-04     6155
Michael 2020-01-01     7172
        2020-01-02     6362
        2020-01-03     5982
        2020-01-04     7917
        2020-01-05     7837
Oscar   2020-01-01     9656
        2020-01-02     8661
        2020-01-03     7075
        2020-01-04     2524
        2020-01-05     2793

In [61]:
sales.pivot_table(
    index=["Date", "Name"],
    values="Revenue",
    aggfunc="sum"
)

                    Revenue
Date       Name
2020-01-01 Creed       4430
           Dwight      2639
           Jim         1864
           Michael     7172
           Oscar       9656
2020-01-02 Creed      13214
           Jim         8278
           Michael     6362
           Oscar       8661
2020-01-03 Dwight     11912
           Jim         4226
           Michael     5982
           Oscar       7075
2020-01-04 Creed       3144
           Jim         6155
           Michael     7917
           Oscar       2524
2020-01-05 Creed        938
           Dwight      7771
           Michael     7837
           Oscar       2793

In [62]:
sales.pivot_table(
    index="Name",
    values=["Revenue", "Expenses"],
    aggfunc="sum"
)

         Expenses  Revenue
Name
Creed        6589    21726
Dwight       5124    22322
Jim          6005    20523
Michael      6359    35270
Oscar        5890    30709

In [63]:
sales.pivot_table(
    index="Name",
    values=["Revenue", "Expenses"],
    aggfunc="mean"
)

            Expenses      Revenue
Name
Creed    1317.800000  4345.200000
Dwight   1024.800000  4464.400000
Jim      1201.000000  4104.600000
Michael  1271.800000  7054.000000
Oscar     981.666667  5118.166667

In [64]:
sales.pivot_table(
    index="Name",
    values=["Revenue", "Expenses"],
    aggfunc="min"
)

         Expenses  Revenue
Name
Creed         548      938
Dwight        368     2639
Jim           426     1864
Michael       412     5982
Oscar         531     2524

In [65]:
sales.pivot_table(
    index="Name",
    values=["Revenue", "Expenses"],
    aggfunc="max"
)

         Expenses  Revenue
Name
Creed        1906     8026
Dwight       1475     7771
Jim          1923     8278
Michael      1857     7917
Oscar        1767     8661

In [66]:
sales.pivot_table(
    index="Name",
    columns="Customer",
    values=["Revenue", "Expenses"],
    aggfunc="sum"
)

                  Expenses                                           \
Customer Average Paper Co. Best Paper Co. Logistics XYZ Money Corp.
Name
Creed               3674.0            NaN           NaN      1601.0
Dwight                 NaN         1321.0        1960.0         NaN
Jim                  426.0            NaN           NaN       462.0
Michael                NaN         3490.0         412.0         NaN
Oscar                  NaN            NaN         531.0       661.0

                                                      Revenue                 \
Customer Paper Pound PaperGenius PaperMaven Average Paper Co. Best Paper Co.
Name
Creed            NaN         NaN     1314.0           13214.0            NaN
Dwight        1475.0       368.0        NaN               NaN         2703.0
Jim           1923.0      1305.0     1889.0            2287.0            NaN
Michael          NaN      2457.0        NaN               NaN        15754.0
Oscar         2391.0       906.0     1401.0               NaN            NaN


Customer Logistics XYZ Money Corp. Paper Pound PaperGenius PaperMaven
Name
Creed              NaN      5368.0         NaN         NaN     3144.0
Dwight          9209.0         NaN      7771.0      2639.0        NaN
Jim                NaN      8278.0      4226.0      1864.0     3868.0
Michael         7172.0         NaN         NaN     12344.0        NaN
Oscar           5250.0      4406.0      5317.0      7075.0     8661.0

In [67]:
sales.pivot_table(
    index="Name",
    columns="Customer",
    values="Revenue",
    aggfunc="min"
)

Customer,Average Paper Co.,Best Paper Co.,Logistics XYZ,Money Corp.,Paper Pound,PaperGenius,PaperMaven
Name,,,,,,,
Creed,5188.0,NaN,NaN,938.0,NaN,NaN,3144.0
Dwight,NaN,2703.0,4258.0,NaN,7771.0,2639.0,NaN
Jim,2287.0,NaN,NaN,8278.0,4226.0,1864.0,3868.0
Michael,NaN,7837.0,7172.0,NaN,NaN,5982.0,NaN
Oscar,NaN,NaN,5250.0,4406.0,2524.0,7075.0,8661.0

In [68]:
sales.pivot_table(
    index="Name",
    columns="Customer",
    values="Revenue",
    aggfunc=["min", "count"]
)

                       min                                           \
Customer Average Paper Co. Best Paper Co. Logistics XYZ Money Corp.
Name
Creed               5188.0            NaN           NaN       938.0
Dwight                 NaN         2703.0        4258.0         NaN
Jim                 2287.0            NaN           NaN      8278.0
Michael                NaN         7837.0        7172.0         NaN
Oscar                  NaN            NaN        5250.0      4406.0

                                                        count                 \
Customer Paper Pound PaperGenius PaperMaven Average Paper Co. Best Paper Co.
Name
Creed            NaN         NaN     3144.0               2.0            NaN
Dwight        7771.0      2639.0        NaN               NaN            1.0
Jim           4226.0      1864.0     3868.0               1.0            NaN
Michael          NaN      5982.0        NaN               NaN            2.0
Oscar         2524.0      7075.0     8661.0               NaN            NaN


Customer Logistics XYZ Money Corp. Paper Pound PaperGenius PaperMaven
Name
Creed              NaN         2.0         NaN         NaN        1.0
Dwight             2.0         NaN         1.0         1.0        NaN
Jim                NaN         1.0         1.0         1.0        1.0
Michael            1.0         NaN         NaN         2.0        NaN
Oscar              1.0         1.0         2.0         1.0        1.0

In [69]:
sales.pivot_table(
    index="Name",
    columns="Customer",
    values="Revenue",
    aggfunc="sum",
    fill_value=0,
    margins=True,
    margins_name="Total"
)

Customer,Average Paper Co.,Best Paper Co.,Logistics XYZ,Money Corp.,Paper Pound,PaperGenius,PaperMaven,Total
Name,,,,,,,,
Creed,13214,0,0,5368,0,0,3144,21726
Dwight,0,2703,9209,0,7771,2639,0,22322
Jim,2287,0,0,8278,4226,1864,3868,20523
Michael,0,15754,7172,0,0,12344,0,35270
Oscar,0,0,5250,4406,5317,7075,8661,30709
Total,15501,18457,21631,18052,17314,23922,15673,130550

In [70]:
# create two simple pivot tables. one is A and another is B

p1 = sales.pivot_table(
    index="Name",
    columns="Customer",
    values="Revenue",
    aggfunc="sum"
)    

p2 = sales.pivot_table(
    index=["Name", "Date"],
    values="Revenue",
    aggfunc="sum"
)  

# stack(), unstack()

In [71]:
p1.stack()

Name     Customer
Creed    Average Paper Co.    13214.0
         Money Corp.           5368.0
         PaperMaven            3144.0
Dwight   Best Paper Co.        2703.0
         Logistics XYZ         9209.0
         Paper Pound           7771.0
         PaperGenius           2639.0
Jim      Average Paper Co.     2287.0
         Money Corp.           8278.0
         Paper Pound           4226.0
         PaperGenius           1864.0
         PaperMaven            3868.0
Michael  Best Paper Co.       15754.0
         Logistics XYZ         7172.0
         PaperGenius          12344.0
Oscar    Logistics XYZ         5250.0
         Money Corp.           4406.0
         Paper Pound           5317.0
         PaperGenius           7075.0
         PaperMaven            8661.0
dtype: float64

In [72]:
p2.unstack()

           Revenue
Date    2020-01-01 2020-01-02 2020-01-03 2020-01-04 2020-01-05
Name
Creed       4430.0    13214.0        NaN     3144.0      938.0
Dwight      2639.0        NaN    11912.0        NaN     7771.0
Jim         1864.0     8278.0     4226.0     6155.0        NaN
Michael     7172.0     6362.0     5982.0     7917.0     7837.0
Oscar       9656.0     8661.0     7075.0     2524.0     2793.0

### **Melting a Dataset**

- unpivot the pivoted data is called melting a dataset

In [73]:
# dataset = video game sales

vgs = pd.read_csv("data/video_game_sales.csv")
vgs

,Name,NA,EU,JP,Other
0,Wii Sports,41.49,29.02,3.77,8.46
1,Super Mario Bros.,29.08,3.58,6.81,0.77
2,Mario Kart Wii,15.85,12.88,3.79,3.31
3,Wii Sports Resort,15.75,11.01,3.28,2.96
4,Pokemon Red/Pokemon Blue,11.27,8.89,10.22,1.00
...,...,...,...,...,...
16561,Woody Woodpecker in Crazy Castle 5,0.01,0.00,0.00,0.00
16562,Men in Black II: Alien Escape,0.01,0.00,0.00,0.00
16563,SCORE International Baja 1000: The Official Game,0.00,0.00,0.00,0.00
16564,Know How 2,0.00,0.01,0.00,0.00
16565,Spirits & Spells,0.01,0.00,0.00,0.00

In [74]:
vgs.melt(id_vars="Name", value_vars="NA")

                                                   Name variable  value
0                                            Wii Sports       NA  41.49
1                                     Super Mario Bros.       NA  29.08
2                                        Mario Kart Wii       NA  15.85
3                                     Wii Sports Resort       NA  15.75
4                              Pokemon Red/Pokemon Blue       NA  11.27
...                                                 ...      ...    ...
16561                Woody Woodpecker in Crazy Castle 5       NA   0.01
16562                     Men in Black II: Alien Escape       NA   0.01
16563  SCORE International Baja 1000: The Official Game       NA   0.00
16564                                        Know How 2       NA   0.00
16565                                  Spirits & Spells       NA   0.01

[16566 rows x 3 columns]

In [75]:
vgs.melt(id_vars="Name", value_vars=["NA", "EU", "JP", "Other"])

                                                   Name variable  value
0                                            Wii Sports       NA  41.49
1                                     Super Mario Bros.       NA  29.08
2                                        Mario Kart Wii       NA  15.85
3                                     Wii Sports Resort       NA  15.75
4                              Pokemon Red/Pokemon Blue       NA  11.27
...                                                 ...      ...    ...
66259                Woody Woodpecker in Crazy Castle 5    Other   0.00
66260                     Men in Black II: Alien Escape    Other   0.00
66261  SCORE International Baja 1000: The Official Game    Other   0.00
66262                                        Know How 2    Other   0.00
66263                                  Spirits & Spells    Other   0.00

[66264 rows x 3 columns]

In [76]:
vgs.melt(id_vars="Name", value_vars=["NA", "EU", "JP", "Other"],
         var_name="Region", value_name="Sales")

                                                   Name Region  Sales
0                                            Wii Sports     NA  41.49
1                                     Super Mario Bros.     NA  29.08
2                                        Mario Kart Wii     NA  15.85
3                                     Wii Sports Resort     NA  15.75
4                              Pokemon Red/Pokemon Blue     NA  11.27
...                                                 ...    ...    ...
66259                Woody Woodpecker in Crazy Castle 5  Other   0.00
66260                     Men in Black II: Alien Escape  Other   0.00
66261  SCORE International Baja 1000: The Official Game  Other   0.00
66262                                        Know How 2  Other   0.00
66263                                  Spirits & Spells  Other   0.00

[66264 rows x 3 columns]

### **Exploding Dataset**

In [77]:
recipes = pd.read_csv("data/recipes.csv")
recipes

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  Apricot preserves, Dijon mustard, curry powder...
1      Tomato Basil Salmon  Salmon filets, basil, tomato, olive oil, Parme...
2  Parmesan Cheese Chicken  Bread crumbs, Parmesan cheese, Italian seasoni...

In [78]:
# information is not much informative here in the ingredients section. 
# split

recipes["Ingredients"] = recipes["Ingredients"].str.split(',')

recipes

# now the ingredient items are in a list, still not much informative

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  [Apricot preserves,  Dijon mustard,  curry pow...
1      Tomato Basil Salmon  [Salmon filets,  basil,  tomato,  olive oil,  ...
2  Parmesan Cheese Chicken  [Bread crumbs,  Parmesan cheese,  Italian seas...

In [79]:
# lets explode the data

recipes.explode("Ingredients")

                    Recipe         Ingredients
0   Cashew Crusted Chicken   Apricot preserves
0   Cashew Crusted Chicken       Dijon mustard
0   Cashew Crusted Chicken        curry powder
0   Cashew Crusted Chicken     chicken breasts
0   Cashew Crusted Chicken             cashews
1      Tomato Basil Salmon       Salmon filets
1      Tomato Basil Salmon               basil
1      Tomato Basil Salmon              tomato
1      Tomato Basil Salmon           olive oil
1      Tomato Basil Salmon     Parmesan cheese
2  Parmesan Cheese Chicken        Bread crumbs
2  Parmesan Cheese Chicken     Parmesan cheese
2  Parmesan Cheese Chicken   Italian seasoning
2  Parmesan Cheese Chicken                 egg
2  Parmesan Cheese Chicken     chicken breasts